In [6]:
df1=pd.DataFrame(np.arange(0,12).reshape(4,3),
                 index=list('1234'),
                 columns=['A','B','C'])

In [2]:
def addition(n):

    return n + n

numbers = (1, 2, 3, 4)

result = map(addition, numbers)

print(list(result))

[2, 4, 6, 8]

In [18]:
df1

   A   B   C
1  0   1   2
2  3   4   5
3  6   7   8
4  9  10  11

In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [8]:
df1.iloc[:,1]

1     1
2     4
3     7
4    10
Name: B, dtype: int32

In [10]:
df1.loc[:,'B']

1     1
2     4
3     7
4    10
Name: B, dtype: int32

In [11]:
df1.iloc[1:3,1]

2    4
3    7
Name: B, dtype: int32

In [25]:
df1.loc[:,'B']#label based #df1.loc[2:3,'B']

1     1
2     4
3     7
4    10
Name: B, dtype: int32

In [29]:
#randint(1,50,size=10)
#randn(10)  #normalized numbers

In [30]:
from numpy.random import randn

In [31]:
randn(10)

array([ 0.50118663,  0.64773537,  0.06031672,  0.06622013, -0.69956722,
       -0.51977933, -2.13763979, -1.03539038, -0.29489637,  1.15219615])

In [39]:
df=pd.DataFrame({'Name':list('ABCDEFGHI'),'Marks':np.random.randint(1,50,size=9)})

In [ ]:
#df=pd.DataFrame({'Name':list('ABCDEFGHI'),'Marks':np.random.randn(9)})

In [40]:
df

  Name  Marks
0    A     36
1    B     48
2    C     14
3    D     47
4    E     12
5    F     29
6    G      2
7    H      1
8    I     37

In [43]:
df2=df.sort_values(by='Marks')

In [45]:
df2.sort_index()

  Name  Marks
0    A     36
1    B     48
2    C     14
3    D     47
4    E     12
5    F     29
6    G      2
7    H      1
8    I     37

In [47]:
df2.sort_index(ascending=0) #descending

  Name  Marks
8    I     37
7    H      1
6    G      2
5    F     29
4    E     12
3    D     47
2    C     14
1    B     48
0    A     36

In [4]:
df1=DataFrame({'Name':list('ABCDEFGHIJ'),'Marks':[55,55,98,96,76,59,76,88,83,74]})

In [5]:
df1['Rank']=df1['Marks'].rank()#rank #its giving rank 1 for lowest value

In [7]:
df1#if two marks are same it will give the average rank

  Name  Marks  Rank
0    A     55   1.5
1    B     55   1.5
2    C     98  10.0
3    D     96   9.0
4    E     76   5.5
5    F     59   3.0
6    G     76   5.5
7    H     88   8.0
8    I     83   7.0
9    J     74   4.0

In [8]:
df1['Rank']=df1['Marks'].rank(ascending=0) #now it will give rnk 1 for highest marks, by default it is ascending

In [9]:
df1

  Name  Marks  Rank
0    A     55   9.5
1    B     55   9.5
2    C     98   1.0
3    D     96   2.0
4    E     76   5.5
5    F     59   8.0
6    G     76   5.5
7    H     88   3.0
8    I     83   4.0
9    J     74   7.0

In [10]:
df1['Rank']=df1['Marks'].rank(ascending=0,method='min')

In [11]:
df1

  Name  Marks  Rank
0    A     55   9.0
1    B     55   9.0
2    C     98   1.0
3    D     96   2.0
4    E     76   5.0
5    F     59   8.0
6    G     76   5.0
7    H     88   3.0
8    I     83   4.0
9    J     74   7.0

In [12]:
df1['Rank']=df1['Marks'].rank(ascending=0,method='max') #max
df1

  Name  Marks  Rank
0    A     55  10.0
1    B     55  10.0
2    C     98   1.0
3    D     96   2.0
4    E     76   6.0
5    F     59   8.0
6    G     76   6.0
7    H     88   3.0
8    I     83   4.0
9    J     74   7.0

In [13]:
df1['Rank']=df1['Marks'].rank(ascending=0,method='dense') #dense
df1

  Name  Marks  Rank
0    A     55   8.0
1    B     55   8.0
2    C     98   1.0
3    D     96   2.0
4    E     76   5.0
5    F     59   7.0
6    G     76   5.0
7    H     88   3.0
8    I     83   4.0
9    J     74   6.0